import React from 'react';

const Blogs = () => {
    return (
        <div className='max-w-5xl mx-auto mt-16' >
            <div className='flex flex-col justify-center gap-8'>
                <div className='mx-auto border p-4 '>
                    <h1 className='text-xl mb-4 text-orange-600'>কনটেক্সট এপিআই কি ?</h1>
                    <p>কনটেক্সট প্রতিটি স্তরে ম্যানুয়ালি প্রপস না পাঠিয়ে কম্পোনেন্ট ট্রির  মাধ্যমে ডাটা প্রদান করার একটি উপায় ।

                        কনটেক্সট এপিআই  প্রতিটি স্তরের মধ্য দিয়ে স্পষ্টভাবে একটি প্রপস পাস না করে উপাদানগুলির মধ্যে একই জাতীয় ডাটা সেয়ার করার একটি উপায় সরবরাহ করে।

                        কনটেক্সট প্রাথমিকভাবে ব্যবহার করা হয় যখন কিছু সংখ্যক ডাটা বিভিন্ন স্তরে ব্যবহার করার প্রয়োজন পরে ।

                        কনটেক্সট এপিআই ব্যবহার করার ফলে প্রপসের ব্যবহার কমে গেছে ।

                        কনটেক্সট এপিআই ডাটা প্রতিটি কম্পোনেন্টে সেয়ার  করার জন্য ডিজাইন করা হয়েছে যার ফলে সকল কম্পোনেন্টের জন্য গ্লোবাল হিসাবে বিবেচিত হয় । </p>
                </div>
                <div className='border p-4'> 
                    <h1 className='text-xl mb-4 text-orange-600'> সিমান্টিক ট্যাগ কি ?</h1>
                    <p>সিমান্টিক ইলিমেন্ট গুলো মানুষ এবং মেশিনের সহজে বোধগম্য করার জন্য স্পষ্টভাবে বর্ণনা করে ।
                        header, nav, section, article, aside, footer  এই সকল ইলিমেন্ট দেখতে অনেকটা div এর মত কিন্তু এই গুলোর অর্থের সাথে এদের উদ্দেশ্য এবং ভিতরে থাকা বিষয়বস্তু ধরন সঠিকভাবে বর্ণনা করে থাকে ।

                        এইটার দ্বারা সহজেই চিহ্নত করা যায় কোন ইলিমেন্টের ভিতরে কোন ধরনের তথ্য আছে ।
                        সিমান্টিক ইলিমেন্ট খুব সহজেই পড়া  যায় এবং বুঝা যায় ।

                        সিমান্টিক ইলিমেন্টের ব্যাপক আক্সেসিবিলিটি আছে । যারা স্ক্রিন রিডার এবং দৃষ্টিশক্তিহীন ব্যবহারকারী আছে তারা সহজেই বুঝতে পারে যার অর্থ ব্যবহারকারীদের জন্য আরও ভালো অভিজ্ঞতা বহন করে থাকে ।  
                    </p>
                </div>
                <div className='border p-4'>
                    <h1 className='text-xl mb-4 text-orange-600'>ব্লক, ইনলাইন,  ইনলাইন-ব্লক  এদের মধ্যে পার্থক্য কি ? </h1>
                    <p>
                    ব্লক ইলিমেন্ট সব সময় একটি নতুন লাইনে শুরু হয় এবং ব্রাউজার স্বয়ংক্রিয়ভাবে সামনে পিছনে কিছু স্পেইস যোগ করে ।
                        
                        তাছাড়া একটি ব্লক ইলিমেন্ট ফুল উইডথ নিয়ে নেয় ।  

                        ইনলাইন ইলিমেন্ট নতুন লাইনে শুরু হয় না । এটার উইডথ যত টুকু দরকার সেই অনুসারে নিয়ে থাকে ।

                        ইনলাইনে-ব্লক ইলিমেন্ট  ইনলাইন ইলিমেন্ট মতই এবং পেডিং , মারজিন  চারদিকে
                    </p>
                </div>
            </div>
        </div>
    );
};

export default Blogs;