[
    {
    "id":"201",
    "name": "Leanne Graham",
    "rating":"3",
    "img":"https://images.pexels.com/photos/1181581/pexels-photo-1181581.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260",
    "review":"Hi there! We are sorry to hear the Two Timer Dual Ended Eyeliner arrived dry. Please know you have reached NYX Professional Makeup US. Our products vary country to country. We have forwarded your experience to the appropriate department for further assistance. Thank you for reaching out."
},
{
    "id":"201",
    "name": "Romaguera-Crona",
    "rating":"5",
    "img":"https://images.pexels.com/photos/1181631/pexels-photo-1181631.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"I bought this eyeliner on a Thursday and I'm writing this on the following Monday and it’s completely try on the felt side. I have loved every other NYX eyeliner I’ve used up to this one. Very disappointed."
},
{
    "id":"201",
    "name":"Ervin Howell",
    "rating":"4",
    "img":"https://images.pexels.com/photos/3865841/pexels-photo-3865841.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"I love all of the nyx makeup products that o use. However, I am not a fan of this new eyeliner. It’s too thick and does not help to create a fine line. I preferred the keepin it tight eye liner. This one would be good for those who like a thicker, Smokey look"
},
{
    "id":"201",
    "name":"Clementine Bauch",
    "rating":"5",
    "img":"https://images.pexels.com/photos/1181714/pexels-photo-1181714.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"I love your retractable eye liner. I received my dark purple and love it. I gave it 5 stars"
},
{
    "id":"201",
    "name":"Patricia Lebsack",
    "rating":"3.5",
    "img":"https://images.pexels.com/photos/1181521/pexels-photo-1181521.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"i sat on a really steamy hot tub with it on for like an hour and then proceeded to pass out TWICE after getting out and my eyeliner was intact"
},
{   "id":"201",
    "name":"Robel-Corkery",
    "rating":"4.5",
    "img":"https://images.pexels.com/photos/3358084/pexels-photo-3358084.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260",
    "review":"Lately every time I buy a new one. It’s super dry after a few uses. Or it starts to leak. Not sure what’s going on. The only reason I still buy it is because I haven’t found a good one that is waterproof. Please fix this problem."
},
{
    "id":"201",
    "name":"Mrs. Dennis Schulist",
    "rating":"4",
    "img":"https://images.pexels.com/photos/5940022/pexels-photo-5940022.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500",
    "review":"Love the pen style liner but the color fades quickly from the pen. I don't let that stop me from continuing to buy because i love the feel & formula. It just seems like I'm opening a new liner quickly."
}
]