[
    {
    "id":"201",
    "name": "Sophia",
    "rating":"3.5",
    "img":"https://images.pexels.com/photos/1181581/pexels-photo-1181581.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260",
    "review":"I have always loved my eyeliner but i have always hated the black smudge lines you get. I finally found one that doesn't smudge! And if you forget to wash off before bed, it doesn't make a mess of your face when you wake up the next morning."
},
{
    "id":"202",
    "name": "Jennifer M. Roberts",
    "rating":"2.5",
    "img":"https://images.pexels.com/photos/1181631/pexels-photo-1181631.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"I bought this eyeliner on a Thursday and I'm writing this on the following Monday and it’s completely try on the felt side. I have loved every other NYX eyeliner I’ve used up to this one. Very disappointed."
},
{
    "id":"203",
    "name":"Caramella",
    "rating":"4",
    "img":"https://images.pexels.com/photos/3865841/pexels-photo-3865841.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"Better than old non-waterproof eyeliner! Blends well on lashline. Some remains on waterline after hours of wear, but seeps at edges. However, goes all melty and breaks when sharpened. This was fixed by freezing it before sharpening."
},
{
    "id":"204",
    "name":"Viktoria",
    "rating":"5",
    "img":"https://images.pexels.com/photos/1181714/pexels-photo-1181714.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"I love your retractable eye liner. I received my dark purple and love it. I gave it 5 stars"
},
{
    "id":"205",
    "name":"Cynthia Bowen",
    "rating":"3.5",
    "img":"https://images.pexels.com/photos/1181521/pexels-photo-1181521.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
    "review":"i sat on a really steamy hot tub with it on for like an hour and then proceeded to pass out TWICE after getting out and my eyeliner was intact"
},
{   "id":"206",
    "name":"Angela Ornelas",
    "rating":"4.5",
    "img":"https://images.pexels.com/photos/3358084/pexels-photo-3358084.jpeg?auto=compress&cs=tinysrgb&h=750&w=1260",
    "review":"Lately every time I buy a new one. It’s super dry after a few uses. Or it starts to leak. Not sure what’s going on. The only reason I still buy it is because I haven’t found a good one that is waterproof. Please fix this problem."
},
{
    "id":"207",
    "name":"Nicole Mannon",
    "rating":"4",
    "img":"https://images.pexels.com/photos/5940022/pexels-photo-5940022.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500",
    "review":"Love the pen style liner but the color fades quickly from the pen. I don't let that stop me from continuing to buy because i love the feel & formula. It just seems like I'm opening a new liner quickly."
}
]